Title: Pivot Tables 
Slug: pivot-table-python-pandas
Summary: Implementing a pivot table in Python using pandas with simple examples
Date: 2018-11-23 20:00  
Category: Python
Subcategory: Data Analysis in pandas
PostType: Tutorial
Keywords: pivot table pandas
Tags: pivot table, python, pandas
Authors: Dan Friedman

**Pivot tables** allow us to perform group-bys on columns and specify aggregate metrics for columns too. This data analysis technique is very popular in GUI spreadsheet applications and also works well in Python using pandas.

### Import Modules

In [62]:
import pandas as pd
import seaborn as sns
import numpy as np

### Example 1: Pivot Tables with Flights Dataset

#### Get Data

Let's get the `flights` dataset included in the `seaborn` library and assign it to the DataFrame `df_flights`.

In [63]:
df_flights = sns.load_dataset('flights')

Preview the first few rows of `df_flights`. 

Each row represents a month's flight history details. The `passengers` column represents that total number of passengers that flew that month.

In [64]:
df_flights.head()

   year     month  passengers
0  1949   January         112
1  1949  February         118
2  1949     March         132
3  1949     April         129
4  1949       May         121

#### Implement Pivot Tables

I want to know the sum of passengers that flew on planes for each year. So, from pandas, we'll call the `pivot_table()` method and set the following arguments:

- `data` to be our DataFrame `df_flights`
- `index` to be `year` since that's the column from `df_flights` that we want to appear as a unique value in each row
- `values` as `passengers` since that's the column we want to apply some aggregate operation on
- `aggfunc` to `sum` since we want to sum (aka total) up all values in `passengers` that belong to a unique year

In [65]:
pd.pivot_table(data=df_flights, index='year', values='passengers', aggfunc='sum')

year
1949    1520
1950    1676
1951    2042
1952    2364
1953    2700
1954    2867
1955    3408
1956    3939
1957    4421
1958    4572
1959    5140
1960    5714
Name: passengers, dtype: int64

We can see above that every year, the total number of passengers that flew increased each year. However, this pivot table is poorly documented. It's unclear what the values in the series mean. To fix this, we'll cast this outputted series to a DataFrame and rename the aggregated column to be clearer.

We used the <a href='https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.reset_index.html' rel='nofollow'>`reset_index()`</a> method to cast our series to a DataFrame with a new index and then chain the <a href='https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.rename.html' rel='nofollow'>`rename()`</a> method to rename a column.

In [66]:
pd.pivot_table(data=df_flights, index='year', values='passengers', aggfunc='sum').reset_index().rename(columns={'passengers': 'total_passengers'})

    year  total_passengers
0   1949              1520
1   1950              1676
2   1951              2042
3   1952              2364
4   1953              2700
5   1954              2867
6   1955              3408
7   1956              3939
8   1957              4421
9   1958              4572
10  1959              5140
11  1960              5714

Now, I want to know the sum of passengers per month in the dataset. So, from pandas, we'll call the the `pivot_table()` method and include all of the same arguments above, except we'll set the `index` to be `month` since that's the column from `df_flights` that we want to appear as a unique value in each row.

In [67]:
pd.pivot_table(data=df_flights, index='month', values='passengers', aggfunc='sum').reset_index().rename(columns={'passengers': 'total_passengers'})

        month  total_passengers
0     January              2901
1    February              2820
2       March              3242
3       April              3205
4         May              3262
5        June              3740
6        July              4216
7      August              4213
8   September              3629
9     October              3199
10   November              2794
11   December              3142

Our results indicate most people flew in the summer months of July and August.

Now, I want to know the average number of passengers that flew per month in the dataset. So, from pandas, we'll call the the `pivot_table()` method and include all of the same arguments from the previous operation, except we'll set the `aggfunc` to `mean` since we want to find the mean (aka average) number of passengers that flew in each unique month.

In [68]:
pd.pivot_table(data=df_flights, index='month', values='passengers', aggfunc='mean').reset_index().rename(columns={'passengers': 'average_number_of_passengers'})

        month  average_number_of_passengers
0     January                    241.750000
1    February                    235.000000
2       March                    270.166667
3       April                    267.083333
4         May                    271.833333
5        June                    311.666667
6        July                    351.333333
7      August                    351.083333
8   September                    302.416667
9     October                    266.583333
10   November                    232.833333
11   December                    261.833333

Now, I want to know the maximum number of passengers that flew per month in the dataset. So, from pandas, we'll call the the `pivot_table()` method and include all of the same arguments from the previous operation, except we'll set the `aggfunc` to `max` since we want to find the maximum (aka largest) number of passengers that flew in each unique month.

In [69]:
pd.pivot_table(data=df_flights, index='month', values='passengers', aggfunc='median').reset_index().rename(columns={'passengers': 'median_number_of_passengers'})

        month  median_number_of_passengers
0     January                        223.0
1    February                        214.5
2       March                        251.5
3       April                        252.0
4         May                        252.0
5        June                        289.5
6        July                        333.0
7      August                        320.0
8   September                        285.5
9     October                        251.5
10   November                        220.0
11   December                        253.5

### Example 2: Pivot Tables with Tips Dataset

#### Get Data

Let's get the `tips` dataset included in the `seaborn` library and assign it to the DataFrame `df_tips`.

In [70]:
df_tips = sns.load_dataset('tips')

Each row represents a unique meal for a party of people and the following fields:

column name | column description 
--- | ---
`total_bill` | financial amount of meal in U.S. dollars
`tip` |  financial amount of the meal's tip in U.S. dollars
`sex` | gender of server
`smoker` | boolean to represent if server smokes or not
`day` | day of week
`time` | meal name (Lunch or Dinner)
`size` | count of people eating meal

Preview the first 5 rows of `df_tips`.

In [71]:
df_tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

#### Implement Pivot Tables

For each day and meal type, I'm curious what was the median bill amount. So, from pandas, we'll call the `pivot_table()` method and set the following arguments:

- `data` to be our DataFrame `df_tips`
- `index` to be [`day`, `time`] since we want to aggregate by both of those columns so each row represents a unique type of meal for a day 
- `values` as `total_bill` since that's the column we want to apply some aggregate operation on
- `aggfunc` to `median` since we want to find the median value in our `total_bill` column for each day's meal type in our dataset

In [72]:
pd.pivot_table(data=df_tips, index=['day', 'time'], values='total_bill', aggfunc='median').reset_index().rename(columns={'total_bill': 'median_total_bill'})

    day    time  median_total_bill
0  Thur   Lunch             16.000
1  Thur  Dinner             18.780
2   Fri   Lunch             13.420
3   Fri  Dinner             18.665
4   Sat   Lunch                NaN
5   Sat  Dinner             18.240
6   Sun   Lunch                NaN
7   Sun  Dinner             19.630

Now, I'm curious for each day's meal type, what was the maximum tip value and median total bill. We can do this in one pivot table operation too! From pandas, we'll call the `pivot_table()` method and set the following arguments:

- `data` to be our DataFrame `df_tips`
- `index` to be [`day`, `time`] since we want to aggregate by both of those columns so each row represents a unique type of meal for a day 
- `values` as [`total_bill`, `tip`] since we want to perform a specific aggregate operation on each of those columns
- `aggfunc` to `{'total_bill': 'median', 'tip': 'max'}` since we want to find the median value for the `total_bill` column and the maximum value for the `tip` column

In [73]:
pd.pivot_table(data=df_tips, index=['day', 'time'], values=['total_bill', 'tip'], aggfunc={'total_bill': 'median', 'tip': 'max'}).reset_index().rename(columns={'tip': 'max_tip', 'total_bill': 'median_total_bill'})

    day    time  max_tip  median_total_bill
0  Thur   Lunch     6.70             16.000
1  Thur  Dinner     3.00             18.780
2   Fri   Lunch     3.48             13.420
3   Fri  Dinner     4.73             18.665
4   Sat  Dinner    10.00             18.240
5   Sun  Dinner     6.50             19.630

### Aggregate Operations

Other aggregate operations you could perform with the following values to pass to the `aggfunc` argument are:

value | description 
--- | ---
`sum` | summation 
`mean` | average
`count` | count
`max` | maximum value
`min` | minimum value
`np.std` | standard deviation
`median` | median